## Pandas join

In [1]:
# Pandas join method ----- Dataframe join is a convenient method for combining the colimns of two potentially differently indexed

# pandas ke join method se hum two different data frame ko join kar sakte hai which have totly different index

In [2]:
import pandas as pd

In [7]:
df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

df2 = pd.DataFrame({'C':[4,5,6],
                   'D':[40,50,60]})

# Now we use display function to display the data 

display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [8]:
df1.join(df2) # here both the dataframe is join

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [9]:
# change the order of the DataFRame
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [10]:
# if the dataframe index is not same in both the dataframe then join function is not execute 
# for join operation the index of the DataFrame is must be same

##### How

In [12]:
# if unequal dataframe is thier then we use how parameter

In [14]:
# now call the data frame 

df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

df2 = pd.DataFrame({'C':[4,5],
                   'D':[40,50]})

display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50

In [17]:
df1.join(df2) # it take dafault value left

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [18]:
df1.join(df2,how = 'right') # it take right value

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [19]:
df1.join(df2,how = 'inner')

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [20]:
df1.join(df2,how = 'outer')

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

#### lsufix,rsufix

In [26]:
# if both the dataframe have same name and same column 

df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})

df2 = pd.DataFrame({'A':[4,5,6],
                   'B':[40,50,60]})

display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   A   B
0  4  40
1  5  50
2  6  60

In [27]:
df1.join(df2,rsuffix = '_1')

   A_1  B_1  A   B
0    1   10  4  40
1    2   20  5  50
2    3   30  6  60